local koi2u = {
	[192]	= 0x044e;--ю
	[193]	= 0x0430;--а
	[194]	= 0x0431;--б
	[195]	= 0x0446;--ц
	[196]	= 0x0434;--д
	[197]	= 0x0435;--е
	[198]	= 0x0444;--ф
	[199]	= 0x0433;--г
	[200]	= 0x0445;--х
	[201]	= 0x0438;--и
	[202]	= 0x0439;--й
	[203]	= 0x043a;--к
	[204]	= 0x043b;--л
	[205]	= 0x043c;--м
	[206]	= 0x043d;--н
	[207]	= 0x043e;--о
	[208]	= 0x043f;--п
	[209]	= 0x044f;--я
	[210]	= 0x0440;--р
	[211]	= 0x0441;--с
	[212]	= 0x0442;--т
	[213]	= 0x0443;--у
	[214]	= 0x0436;--ж
	[215]	= 0x0432;--в
	[216]	= 0x044c;--ь
	[217]	= 0x044b;--ы
	[218]	= 0x0437;--з
	[219]	= 0x0448;--ш
	[220]	= 0x044d;--э
	[221]	= 0x0449;--щ
	[222]	= 0x0447;--ч
	[223]	= 0x044a;--ъ

	[225]	= 0x0410;--А
	[226]	= 0x0411;--Б
	[247]	= 0x0412;--В
	[231]	= 0x0413;--Г
	[228]	= 0x0414;--Д
	[229]	= 0x0415;--Е
	[246]	= 0x0416;--Ж
	[250]	= 0x0417;--З
	[233]	= 0x0418;--И
	[234]	= 0x0419;--Й
	[235]	= 0x041a;--К
	[236]	= 0x041b;--Л
	[237]	= 0x041c;--М
	[238]	= 0x041d;--Н
	[239]	= 0x041e;--О
	[240]	= 0x041f;--П
	[242]	= 0x0420;--Р
	[243]	= 0x0421;--С
	[244]	= 0x0422;--Т
	[245]	= 0x0423;--У
	[230]	= 0x0424;--Ф
	[232]	= 0x0425;--Х
	[227]	= 0x0426;--Ц
	[254]	= 0x0427;--Ч
	[251]	= 0x0428;--Ш
	[253]	= 0x0429;--Щ
	[255]	= 0x042a;--Ъ
	[249]	= 0x042b;--Ы
	[248]	= 0x042c;--Ь
	[252]	= 0x042d;--Э
	[224]	= 0x042e;--Ю
	[241]	= 0x042f;--Я
}

function xlat(n)
	n = n + 0x10
	if n >= 0xa0 then n = n + 0x20 end
	if koi2u[n] then
		return koi2u[n]
	end
	return n
end

local f = io.open("bk.txt", "r")
local iter = f:lines()
for i=0,207 do
	print(string.format("0x%04x", xlat(i)))-- + 0x10))--xlat(i)))
	local l = iter()
	local m = {}

	for x in l:gmatch("[^, %]]+") do
		if #m >= 10 then
			break
		end
		local xx = tonumber(x, 8)
		if xx then
		--	print(string.format("%s %x\n", x, xx))
			table.insert(m, math.floor(xx % 0x100))
			table.insert(m, math.floor(xx / 0x100))
		end
	end
	if m[9] == 0 and m[10] == 0 then
		table.remove(m, 10)
		table.remove(m, 9)
	end
--	os.exit(1)
	if #m > 8 then
		print "!!!!!!!!!!!!!!!!!!"
	end
	for y = 1, #m do
		local r = ''
		b = m[y]
		for i=1,8 do
			r = ((b >= 128) and '#' or '-') .. r
			if b >= 128 then b = b - 128 end
			b = b * 2
		end
		print(r)
	end
	print()
end
